Repository: Stanislav-66/unikit
Catalog: lib/l10n/intl_*.arb
Languages: ru

# title_appbar
source: Moscow State University of Technologies and Management
ru: Университетский колледж информационных технологий

source: Menu
ru: Меню

source: Home Page
ru: Домашняя страница

source: Teachers
ru: Преподаватели

# awards
source: Awards and achievements
ru: Награды и достижения

# chat
source: Support chat
ru: Чат поддержки

source: Exit
ru: Выход

source: Settings
ru: Настройки

source: Email
ru: Электронный адрес

source: Password
ru: Пароль

source: Sign in
ru: Войти

# theme_update
source: Change theme
ru: Сменить тему

source: Account information
ru: Информация об аккаунте

# main_settings
source: Main
ru: Основные

# social_network
source: We are in social networks. Subscribe!
ru: Мы в социальных сетях. Подписывайтесь!

# about
source: Our College of Information Systems and Technologies is a leading educational institution in the IT field, located in the historical center of Moscow. We have strong administrative and teaching capabilities, guaranteeing high quality education. Specialization in the field of information systems and technology provides unique opportunities for developing the skills and knowledge of students, among whom there are more than 300 people. Our teaching staff consists of experienced specialists who are ready to shape future IT professionals.
ru: Наш колледж информационных систем и технологий – ведущее учебное заведение в IT-сфере, расположенное в историческом центре Москвы. Мы обладаем сильным административным и педагогическим потенциалом, гарантируя высокое качество образования. Специализация в области информационных систем и технологий предоставляет уникальные возможности для развития навыков и знаний студентов, среди которых более 300 человек. Наш преподавательский состав состоит из опытных специалистов, готовых формировать будущих профессионалов IT-сферы.

source: News
ru: Новости

source: Sign Up
ru: Зарегистрироваться

source: Registration successful!
ru: Регистрация прошла успешно!

# emptyField
source: Please fill in this field
ru: Пожалуйста, заполните это поле

# validEmail
source: Please enter a valid email
ru: Введите, пожалуйста, действительный адрес электронной почты

# password8
source: The password length must not be less than 8 characters.
ru: Длинна пароля не должна быть менее 8 символов

# passwordNumber
source: The password must have at least one number
ru: Пароль должен иметь хотя бы одно число

# passwordUpperLower
source: The password must contain both lowercase and uppercase (capital) letters
ru: Пароль должен содержать как строчные, так и прописные (заглавные) буквы

# specialChar
source: The password must have at least one special character
ru: Пароль должен иметь хотя бы один специальный символ

# load_app
source: Loading...
ru: Загрузка...

# title_special
source: About the specialty
ru: О специальности

# text_speciality1
source: Humanity is increasingly relying on the work of smart machines. And it is programmers who make smart machines. Modern programmers not only write program code, they think over the architecture of systems, create and train artificial intelligence, and develop robots. The demand for highly qualified programmers is growing every day. Many professions will disappear in the future, but not the profession of a programmer.
ru: Человечество все больше полагается на работу умных машин. А умными машины делают именно программисты. Современные программисты не только пишут программный код, они продумывают архитектуру систем, создают и обучают искусственный интеллект, разрабатывают роботов. Спрос на высококвалифицированных программистов растет с каждым днем. Многие профессии в будущем исчезнут, но не профессия программиста.

# special_090307
source: 02.09.07 Information systems and programming
ru: 09.02.07 Информационные системы и программирование

# text_speciality2
source: At our college, you will learn how to program, starting with the fundamentals (namely, their understanding is checked at job interviews) and ending with the development of mobile applications using a rising star - the most modern programming language kotlin. During the training, you will master the foundation of modern development - object-oriented programming (including programming patterns and the latest frameworks) and functional programming, which is becoming popular again. You will acquire flexible skills (Soft Skills), such as presentation skills, successful communication, self-study, and work in a project team, which guarantees successful adaptation in a rapidly changing world. Choosing the qualification "programmer" or "developer of web and multimedia applications" is the key to success in a professional career.
ru: У нас в колледже вы научитесь программировать, начиная с фундаментальных основ (а именно их понимание проверяют на собеседованиях при приеме на работу) и заканчивая разработкой мобильных приложений с использованием восходящей звезды - современнейшего языка программирования kotlin. В ходе обучения вы освоите фундамент современной разработки - объектно-ориентированное программирование (включая паттерны программирования и новейшие фреймворки) и вновь становящееся популярным функциональное программирование. Вы приобретете гибкие навыки (SoftSkills), такие как навыки презентации, успешной коммуникации, самообучения, работе в проектной команде, что гарантирует успешную адаптацию в быстро меняющемся мире. Выбор квалификации "программист" или "разработчик web и мультимедиа приложений" - залог успеха в профессиональной карьере.

# teacher_list
source: The composition of teaching staff
ru: Состав педагогических работников

# gluscer
source: Alexander I. Glusker, Chairman of the PCC, teacher
ru: Глускер Александр Игоревич, председатель ПЦК, преподаватель

# director
source: Alexandrov Roman Viktorovich, College director, teacher
ru: Александров Роман Викторович, директор колледжа, преподаватель

# valeev
source: Mikhail Vladimirovich Valeev, teacher
ru: Валеев Михаил Владимирович, преподаватель

# dzuba
source: Dzyuba Irina Georgievna, Head of Department No. 3, teacher
ru: Дзюба Ирина Георгиевна, заведующая отделением № 3, преподаватель

# kuzma
source: Kuzmenko Svetlana Yurievna, teacher
ru: Кузьменко Светлана Юрьевна, преподаватель

# larionova
source: Larionova Elena Anatolyevna, teacher
ru: Ларионова Елена Анатольевна, преподаватель

# plahutina
source: Plakhutina Larisa Alexandrovna
ru: Плахутина Лариса Александровна

# podobin
source: Valery A. Podobin, teacher
ru: Подобин Валерий Алексеевич, преподаватель

# sabirhanova
source: Sabirdzhanova Ekaterina Vitalievna
ru: Сабиржанова Екатерина Витальевна

# hustochka
source: Alyona Vitalievna Khustochka, teacher
ru: Хусточка Алена Витальевна, преподаватель

# list_point_tittle1
source: The field of professional activity of graduates
ru: Область профессиональной деятельности выпускников

# list_point1_item1
source: Development of software modules for computer systems
ru: Разработка модулей программного обеспечения для компьютерных систем

# list_point1_item2
source: Implementation of the integration of software modules
ru: Осуществление интеграции программных модулей

# list_point1_item3
source: Maintenance and maintenance of computer system software
ru: Сопровождение и обслуживание программного обеспечения компьютерных систем

# list_point1_item4
source: Database and server administration
ru: Администрирование баз данных и серверов

# list_point1_item5
source: Database development, administration and protection
ru: Разработка, администрирование и защита баз данных

# list_point1_item6
source: Design and development of information systems
ru: Проектирование и разработка информационных систем

# list_point1_item7
source: Web Application Design development
ru: Разработка дизайна веб-приложений

# list_point1_item8
source: Design, development and optimization of web applications
ru: Проектирование, разработка и оптимизация веб-приложений

# data_special
source: Duration of study: 3 years 10 months
ru: Срок обучения: 3 года 10 месяцев

# list_point_tittle2
source: Graduate qualification (assigned depending on the chosen specialization):
ru: Квалификация выпускника (присваивается в зависимости от выбранной специализации):

# list_point2_item1
source: database administrator;
ru: администратор баз данных;

# list_point2_item2
source: information technology testing specialist;
ru: специалист по тестированию в области информационных технологий;

# list_point2_item3
source: programmer;
ru: программист;

# list_point2_item4
source: technical writer;
ru: технический писатель;

# list_point2_item5
source: information Systems Specialist;
ru: специалист по информационным системам;

# list_point2_item6
source: information Resources Specialist;
ru: специалист по информационным ресурсам;

# list_point2_item7
source: developer of web and multimedia applications.
ru: разработчик веб и мультимедийных приложений.

# title090207
source: Specialty code: 02.09.07
ru: Код специальности: 09.02.07

# name_special
source: Name of the specialty: Information systems and programming
ru: Наименование специальности: Информационные системы и программирование

# data_special_table
source: Duration of study: on the basis of basic general education, 3 years 10 months
ru: Срок обучения: на базе основного общего образования, 3 года 10 месяцев

# budhet
source: Budget: 150
ru: Бюджет: 150

# payment
source: Contract: 50
ru: Договор: 50

# adress
source: 105120, Moscow, Kostomarovskaya embankment d. 29, +7(985)197-97-58, +7(915)405-46-06, 8(495)640-54-36 ext. 4846 (Admission Committee), priemka@mgkit.ru
ru: 105120, Москва, Костомаровская набережная д. 29, +7(985)197-97-58, +7(915)405-46-06, 8(495)640-54-36 доб. 4846 (Приемная комиссия), priemka@mgkit.ru

# local
source: Language
ru: Язык

source: English
ru: Английский

source: Russian
ru: Русский

# navigateBottom2
source: User
ru: Пользователь

# error_mes
source: An unknown error has occurred. We apologize for the inconvenience
ru: Произошла неизвестная ошибка. Просим прощения за неудобство

# altsign
source: Other ways to log in
ru: Другие способы входа

source: Search...
ru: Поиск...

# reg
source: Registration
ru: Регистрация

# question_title
source: Frequently Asked Questions
ru: Часто задаваемые вопросы

# q1
source: What subjects will I study as a programmer?
ru: Какие предметы я буду изучать на специальности программист?

# q2
source: What professional skills can be acquired at the College of Information Systems and Technology?
ru: Какие профессиональные навыки можно приобрести в колледже информационных систем и технологий?

# q3
source: What employment opportunities are there for graduates of the programmer specialty?
ru: Какие возможности трудоустройства есть для выпускников специальности программист?

# q4
source: Is there a college internship for students majoring in computer programming?
ru: Есть ли практика в колледже для студентов по специальности программист?

# q5
source: How long does it take to study as a programmer in college?
ru: Сколько времени занимает обучение на специальности программист в колледже?

# q6
source: What are the requirements for admission to the programmer's specialty at the College of Information Systems and Technologies?
ru: Каковы требования для поступления на специальность программиста в Колледж информационных систем и технологий?

# q7
source: Can I work in parallel with studying to be a programmer?
ru: Могу ли я работать параллельно с обучением на специальности программист?

# q8
source: What are the career prospects for a programming specialist?
ru: Какие перспективы развития карьеры у специалиста по программированию?

# q9
source: What additional educational resources does the college provide for students majoring in programming?
ru: Какие дополнительные образовательные ресурсы предоставляет колледж для студентов специальности программист?

# q10
source: What types of projects do students carry out in the specialty programmer?
ru: Какие виды проектов студенты выполняют на специальности программист?

# answer1
source: As a programmer, you will study programming, databases, algorithms and data structures, web development, computer networks, operating systems and other technical disciplines.
ru: На специальности программист вы будете изучать программирование, базы данных, алгоритмы и структуры данных, веб-разработку, компьютерные сети, операционные системы и другие технические дисциплины.

# answer2
source: You will be able to acquire programming skills in various languages, work with databases, develop web applications, test software, analyze data and much more.
ru: Вы сможете приобрести навыки программирования на различных языках, работы с базами данных, разработки веб-приложений, тестирования программного обеспечения, анализа данных и многое другое.

# answer3
source: Graduates of the programmer specialty are in demand in the labor market as software developers, testers, system analysts, as well as information security specialists.
ru: Выпускники специальности программист востребованы на рынке труда как разработчики программного обеспечения, тестировщики, системные аналитики, а также специалисты по информационной безопасности.

# answer4
source: Yes, the College of Information Systems and Technologies provides practices that allow students to apply their knowledge in practice in real projects and companies.
ru: Да, в колледже информационных систем и технологий предусмотрены практики, которые позволяют студентам применить полученные знания на практике в реальных проектах и компаниях.

# answer5
source: Usually, training in the specialty of a programmer in college lasts from 2 to 3 years, depending on the form of study (full-time / part-time) and the training program.
ru: Обычно обучение на специальности программист в колледже длится от 2 до 3 лет в зависимости от формы обучения (очная/заочная) и программы обучения.

# answer6
source: Admission to the programmer's specialty usually requires secondary education, successful completion of entrance exams in mathematics and computer science, as well as a desire to study computer technology.
ru: Для поступления на специальность программист обычно требуется среднее образование, успешное сдача вступительных экзаменов по математике и информатике, а также желание изучать компьютерные технологии.

# answer7
source: For most students, studying as a programmer requires full dedication and time, but some students successfully combine their studies with work.
ru: Для большинства студентов обучение на специальности программист требует полной отдачи и времени, однако некоторые студенты успешно сочетают учебу с работой.

# answer8
source: Programming specialists have excellent career prospects, as the IT industry is constantly developing, and the demand for qualified programming specialists is only growing.
ru: Специалисты по программированию имеют отличные перспективы развития карьеры, так как IT-индустрия постоянно развивается, и спрос на квалифицированных специалистов по программированию только растет.

# answer9
source: The College of Information Systems and Technology provides students with access to libraries, online courses, workshops, conferences and other educational resources to enhance knowledge and skills.
ru: Колледж информационных систем и технологий предоставляет студентам доступ к библиотекам, онлайн-курсам, мастер-классам, конференциям и другим образовательным ресурсам для расширения знаний и навыков.

# answer10
source: Students of the programmer specialty carry out various projects, starting from the creation of websites and applications, ending with the development of algorithms and games, which allows them to apply their knowledge in practice.
ru: Студенты специальности программист выполняют различные проекты, начиная от создания веб-сайтов и приложений, заканчивая разработкой алгоритмов и игр, что позволяет им применить полученные знания на практике.

# contact
source: Contacts
ru: Контакты

# pdf_dowload
source: PDF downloaded successfully
ru: PDF-файл успешно загружен

# failed_dowload_pdf
source: Failed to download PDF
ru: Не удалось загрузить PDF-файл

# dowload_mes
source: The download is complete
ru: Загрузка завершена

# title_coledge
source: UniKIT
ru: УниКИТ

# document_title
source: Documents
ru: Документы

# enrollment
source: Enrollment orders
ru: Приказы о зачислении

source: Cancel
ru: Отменить

source: Replace
ru: Заменить

source: Replace Document
ru: Замена Документа

# name_doc
source: Name
ru: Название

# url_doc
source: URL
ru: ссылка

source: Add
ru: Добавить

# add_title_doc
source: Add Document
ru: Добавления Документа

# contact_adress
source: The college is located at:
ru: Колледж расположен по адресу:

# adress1
source: 105120, Moscow, Kostomarovskaya embankment, 29
ru: 105120, Москва, Костомаровская набережная, д. 29

# thoroughfare
source: Transit:
ru: Проезд:

# email_static
source: Email:
ru: Электронная почта:

# phone_number
source: Telephone:
ru: Телефон:

# adress2
source: Kurskaya metro station, Chkalovskaya, Ilyich Square, Rimskaya, then walk towards the Metrostroy recreation center.
ru: м. Курская, Чкаловская, Площадь Ильича, Римская далее пешком в сторону ДК Метростроя.

# userExit
source: log out of your account
ru: Выйти из учетной записи

source: Change Password
ru: Поменять пароль

source: Change Email
ru: Изменить адрес электронной почты

source: Change Name
ru: Изменить имя

source: User Info
ru: Личный кабинет

# submit
source: Confirmation
ru: Подтверждение

# exitTrueF
source: Are you sure you want to get out?
ru: Вы уверены, что хотите выйти?

# submit_button
source: Confirm
ru: Подтвердить

# enterPassword
source: Enter the password:
ru: Введите пароль:

source: Name
ru: Имя

# forgot
source: Forgot your password?
ru: Забыли пароль?

# messageWarningEmail
source: The password reset email has been sent. Check your email.
ru: Письмо для сброса пароля было отправлено. Проверьте свою почту.

# errorSendLetter
source: Error when sending a password reset email:
ru: Ошибка при отправке письма для сброса пароля:
